Tekla Open API Reference for Tekla Structures 2025
VertexEnumerator Class
 The VertexEnumerator class is used to enumerate the vertexes of a loop instance.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.VertexEnumerator
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class VertexEnumerator : IEnumerator
Public NotInheritable Class VertexEnumerator
	Implements IEnumerator
The VertexEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns the current vertex.
Top
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
Tekla.Structures.Solid Namespace